{"meta":{"title":"JiananYuan' s Home-Page","subtitle":"Welcome to my Blog !","description":"Explore here :-) Go !","author":"JiananYuan","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"College of Computer Science & Software Engineering, Shenzhen University","slug":"College-of-Computer-Science-Software-Engineering-Shenzhen-University","date":"2019-08-13T20:49:40.000Z","updated":"2019-08-13T15:12:48.509Z","comments":true,"path":"2019/08/14/College-of-Computer-Science-Software-Engineering-Shenzhen-University/","link":"","permalink":"http://yoursite.com/2019/08/14/College-of-Computer-Science-Software-Engineering-Shenzhen-University/","excerpt":"深圳大学计算机与软件学院成立于2008年底，其前身是1983年深圳大学建校时创建的电子工程系计算机教研室和2006年成立的深圳大学软件学院。学院由中国科学院院士、全国首届高等学校教学名师陈国良教授担任首任院长。","text":"深圳大学计算机与软件学院成立于2008年底，其前身是1983年深圳大学建校时创建的电子工程系计算机教研室和2006年成立的深圳大学软件学院。学院由中国科学院院士、全国首届高等学校教学名师陈国良教授担任首任院长。 学院概况深圳大学计算机学科由清华大学于1983年建校时援建，清华大学童诗白教授担任系主任，苗永蔚、朱鸣学、黄顺珍、黄云森等一大批来自清华大学的优秀教师为本学科的发展奠定了坚实基础。计算机与软件学院成立后学科得到长足发展，成为省优势重点学科和国家特色专业。在艾瑞深中国校友会网大学研究团队发布的《2017中国大学计算机科学与技术学科排行榜》中，深圳大学计算机科学与技术学科高居第6位。计算机科学与技术专业2017年通过工程教育国际专业认证，培养体系国际等效。 学院先后与美国哈佛大学、哥伦比亚大学、纽约州立宾汉姆顿大学、路易斯安娜理工大学、佩斯大学，英国诺丁汉大学、爱丁堡大学、利物浦大学，香港大学、香港理工大学、武汉大学等中外高校开展学术交流及合作办学；与IBM、Microsoft、Google、Intel、德州仪器、腾讯、SUN、金蝶、中国移动、EMC等著名IT企业建立紧密的人才培养和项目合作关系，共建多个实验室。学院设有多个学生创新俱乐部和社团组织，如ACM程序设计竞赛俱乐部、IBM技术俱乐部、腾讯创新俱乐部以及移动互联网应用开发俱乐部、Apple俱乐部以及辩论队和街舞队等。 学院开展实施优博计划，每年从大三、大四年级中选拔优秀本科生，进入由知名教授领衔、国内外一流教师组成的博导小组，进行为期七年的本硕博深度连续培养和资助，基本奖学金总额超过18万元人民币，另外境外交流学习奖学金，博士毕业后优先推荐到国际一流名校做博士后，博士后出站，优先录用为深大教师。 学院本科生曾获美国大学生数学建模竞赛ICM一等奖和广东省一等奖、挑战杯大赛全国三等奖和广东省特等奖、腾讯创新大赛全国一等奖和个人组全国冠军、以及ACM程序设计大赛亚洲区预选赛银奖和铜奖以及广东省赛一、二等奖等。腾讯公司创始人马化腾，以及中国供应链服务领导者怡亚通供应链股份有限公司董事长周国辉等都是我院毕业生的杰出代表。学生就业面宽，一次就业率高达95%以上，平均工资居全省前列。 师资队伍学院现有专职教师共109人（外籍教师7名），其中教授26名；副教授28名；助理教授30名；具有博士学位的教师96名，具有海外教育经历的教师53名，另外还聘请特约教授20名。其中包括中国科学院院士1名、国家教学名师1名、IEEE Fellow1名、海外杰出青年基金获得者1名，教育部教指委员1名、教育部新世纪优秀人才2名、广东省领军人才2名、广东省杰出青年基金获得者1名、省级“千百十”人才3名、鹏城学者1名、国家优青1名、珠江学者1名、长江学者2名、中科院卢嘉锡青年人才1名、深圳市海外高层次人才47名、深圳大学特聘教授8名及博士生导师14名。科研机构大数据系统计算技术国家工程实验室根据《国家工程实验室管理办法（暂行）》（国家发展改革委令第54号），并按照上述通知有关支持原则和要求，经竞争择优，国家发改委确定深圳大学为大数据系统计算技术国家工程实验室承担单位。标志我校在大数据系统计算领域处于国内领先水平！在国家发改委高技术司正式公布了大数据和互联网+领域国家工程实验室拟确定承担单位名单中，共有19个国家工程实验室入围，深圳大学成为广东省唯一入围大数据领域国家工程实验室的高校。深圳大学计算机与软件学院作为深圳大学承建国家工程实验室的依托学院，拥有本科、硕士与博士人才培养体系，形成具有国内领先优势和特色的大数据学科布局。国家高性能计算中心深圳分中心(高性能计算研究所)是以国家高性能计算中心深圳分中心为主,依托深圳大学计算机与软件学院计算机科学学科建立,由陈国良院士担任实验室主任。广东省移动互联网应用中间件工程技术研究中心依托深圳大学计算机与软件学院，致力于移动互联网中间件技术、云计算、智能推荐等方向研究。近年来，中心在软件中间件、云计算、智能推荐等方面取得了丰硕的研究成果：共承担和完成国家级、省部级、市级以及其他横向科研项目60余项，发表高水平论文200余篇，取得8个发明专利和若干项计算机软件著作权等。 移动金融和移动医疗是中心2大技术应用示范和行业发展方向，中心现已与金融、医疗行业多家企事业单位展开广泛合作。 大数据技术与应用研究所创建于2013年，是深圳大学围绕大数据领域的学科建设、研究生培养、学术研究、技术研发和产业应用的综合性学术机构。研究所以国家大数据战略需求为导向，坚持高起点、高水平、国际化的建设理念，致力成为华南地区大数据领域科技创新、人才培养、产业服务和国际交流合作的基地。研究所注重从大数据产业应用需求中提炼科学问题，力求基础理论和共性关键技术的原始创新。基础研究重点包括：面向大数据的新的抽样方法和计算框架、机器学习方法和算法、统计学习方法、相似性计算、近似计算等。共性关键技术创新重点包括：分布式并行算法、高效ETL处理、高效索引与查询、新型数据挖掘算法、可视分析与展现、数据安全与隐私保护等技术。 未来媒体技术与计算研究所团队成员年轻，具有国际化大视野及国际化合作研究的背景。研究所与国外多所著名研究型大学及公司建立了合作研究和培养顶尖创新科研人才的关系，合作单位包括英国牛津大学，萨里大学及南开大学等。研究所科研人员除了从事国际最前沿的数字媒体领域创新科研之外，还具备科研成果转化，开发与之相关的新技术，新产品及其相关领域内提供权威性咨询的专业水平和技能，并且致力于在互联网技术及数码技术飞速发展的基础上，研究和开发未来媒体技术与产品的新概念。 网络与信息安全研究所研究所围绕“网络与安全学术研究-专利技术积累-标准制定-成果产业化”开展“以产业的前沿需求为起点，以成果的价值兑现为终点”的应用基础研究和人才队伍建设。面向“网络应用”、“网络安全”、“信息安全”、和“智能计算”开展研究，具体内容包括：云计算、车联网、软件定义网络、网络虚拟化等新型网络应用研究；网络安全防御与检测研究及其协议设计；格密码技术、属性基加密、函数加密等密码应用研究；智能计算及其在网络优化和机器人应用研究。 计算机视觉研究所凝聚了图像处理、模式识别、智能优化等计算机视觉理论与应用相关学科人才，从事图像特征提取、选择优化以及机器学习等理论研究，并将其应用于生物特征识别、医学图像辅助诊断以及遥感数据挖掘等领域。研究所在人脸检测、识别，指纹识别、医学图像以及机器学习领域和华为、唯品会、大华以及欧蒙等企业广泛展开了产学研合作。 可视计算研究中心致力于大力提升可视计算科学研究与高等教育水平，以计算机图形学、计算机视觉和可视化为学科基础，促进多个学科的深入交叉和集成创新，重点推进大规模静动态数据获取与融合、多尺度几何建模与智能编辑、复杂场景重建与识别理解、三维移动协同感知与人机交互、海量数据可视化与可视分析等方面的科学技术研究。中心组建了具有国际先进水平的可视计算与可视分析研究实验室, 硬件设备先进齐全。中心与以色列、加拿大、德国、美国和香港地区等国际知名研究小组建立了紧密合作，每年组织举办高水平的国际学术讨论会和暑期学校，进一步加强其国内外学术地位。智能感知与移动计算实验室专注于物联网和移动计算方向，聚集了校内计算机科学、生物科学、物理科学以及认知科学的优势力量而组建的多学科交叉研究机构，近年来引进了多名来自新加坡南洋理工大学、香港科技大学等高校的海外高层次人才。实验室跟香港、新加坡、美国等的高水平大学有合作，联合开展研究，可推荐至国外著名高校深造。实验室经费充足，鼓励产业化与高水平研究相结合。智能技术与系统集成研究所研究所主要依托深圳市嵌入式重点实验室和深圳物联网专用集成电路设计工程实验室，主要研究方向包括计算智能技术、智能技术应用和智能硬件设计，目前研究团队由2位教授、5位副教授、1名讲师，3名博士后、多名研究生组成，团队成员在多个国家自然科学基金和省部基金项目的支持下，已在相关计算智能、机器学习、生物信息学、机器人学、智能芯片设计等相关领域取得了一系列创新研究成果，在国内外权威期刊和会议(TEVC, TCYB, TNN, TIP, SIIMS等)公开发表超过100篇高水平学术论文，取得超过50项发明专利和集成电路布图设计登记证书，在相关领域产生重要影响。学科建设计算机科学与技术（国家级特色专业，省级名牌专业）专业前景计算机科学与技术专业是随着计算机的广泛应用发展起来的，本专业培养的计算机专业人才，可从事各类企事业单位计算机软硬系统的应用开发及其运行管理，包括在科研部门、教育单位、各种类型企业和行政管理部门从事计算机教学、科研和应用开发工作，就业前景广泛。培养目标本专业培养德、智、体等方面全面发展，掌握数学与自然科学基础知识，以及计算机科学理论、计算机软硬件系统及应用知识，基本具备本领域分析问题和解决问题的能力，具有“综合素质好、专业基础好、业务能力强、适应能力强”，能够在国家特别是深圳经济建设和社会发展中起骨干作用的计算机科学技术高级专门人才，也可继续攻读计算机及相关学科的研究生学位。专业方向高性能计算、智能计算、多媒体技术。主要课程计算机导论、计算机系统I、面向对象程序设计、计算机系统II、数据结构与算法、计算机系统III、操作系统、自动机与形式语言、算法设计与分析、编程语言等、软件工程、计算机网络、多媒体系统导论、数据挖掘、信息检索、计算机图形学等。主要实践性教学环节假期实践、计算机工程实践、专业实习和毕业设计(论文)等。专业特色：本专业注重理论与实践结合，着重培养学生解决问题的综合能力，鼓励并提供参与实际科研项目的机会。本专业优势领域包括高性能计算、智能计算和大数据处理、多媒体技术等。另设数学与计算机科学实验班，由计算机与软件学院、数学与计算科学学院联合开设，学生在入学后考试录取，课程设置单列，修完规定学分者可获得工学与理学双学士学位。授予学位工学学士 软件工程（国家级“本科教学工程”综合改革试点专业、广东省首批示范性软件学院）专业前景培养的软件开发相关人才，可在各类企事业单位、政府机关、高等院校及科研机构等重要部门，特别是软件、互联网企业从事软件产品规划、设计、开发、测试、运维、研发管理、技术研究等工作，就业前景十分广泛。软件工程专业从业人员多年来一直具有旺盛的市场就业需求，软件工程师、高级软件工程师的职位需求数连续多年来均居各行业职位需求量排名表前列，对应薪酬待遇水平也稳居各行业，特别是IT行业前列。培养目标本专业培养德、智、体、美全面发展，掌握数学与自然科学基础知识，系统掌握计算机科学基础理论、计算机软/硬件系统及软件工程专业知识，具有工程实践能力，能针对软件工程领域的复杂问题进行分析、设计方案并予以解决，具备良好的人文素养、职业道德和团队合作精神，能够胜任软件工程技术研发、系统分析、设计、开发、测试、运维、管理、服务等工作的工程技术人才，使之成为具有终身学习和自我工程技术持续改善能力、适应社会发展和行业发展、具有创新创业意识的企事业单位骨干。专业方向软件开发、软件分析和嵌入式软件。主要课程软件工程、数据库系统、面向对象程序设计、数据结构、基于UML的面向对象系统分析与设计、软件体系结构与设计模式、计算机论题、计算机系统(1)、计算机系统(2)、操作系统、计算机导论、程序设计基础、高等数学、离散数学、算法设计与分析、自动机与形式语言、编译原理、计算机网络等。专业特色突出校企联合的产学研合作培养模式，强调工程实践与动手能力，优势领域包括软件工程应用技术和嵌入式技术等，与国内外著名软件企业如腾讯、IBM、Intel、金蝶、谷歌、迅雷、太极等进行教学与工程实践合作，以国际先进的工程教育理念CDIO为核心展开工程素质教育。授予学位工学学士 周边环境学院附近IT巨头行业云集，Microsoft、Google、Tencent、Alibaba、Baidu落户高新区，学院附近是深圳市软件产业基地 最新消息(截至2019/8/13 21:14)加拿大三院院士Victor C. M. Leung受聘为深圳大学特聘教授2019年3月，IEEE Fellow、加拿大皇家学院院士、加拿大工程院院士和加拿大工程学院院士Victor C. M. Leung（梁中明）受聘为深圳大学特聘教授，正式加盟计算机与软件学院。 梁院士是著名国际信息通信专家，长期致力于物联网特别是车联网以及无线通讯等方面的研究，现为加拿大皇家学院院士、加拿大皇家科学院、工程院两院院士，曾获IEEE温哥华分会百年纪念奖和UBC Killam研究奖。是IEEE通信学会的杰出报告人，担任或曾担任IEEE Wireless Communications Letters、IEEE Journal on Selected Areas in Communications、IEEE Transactions on Computers、IEEE Transactions on Vehicular Technology 和 IEEE Transactions on Wireless Communications等期刊的编委，在无线网络和移动系统领域发表900余篇学术论文和著作，并在众多国际会议的组织和技术程序委员会中发挥领导作用。 ###深圳大学计算机学科进入ESI全球1% 11月10日，美国基本科学指标数据库（Essential Science Indicators，简称ESI）公布最新数据，深圳大学计算机科学与技术学科（Computer Science）发表的SCI论文共623篇，总被引频次为3360次，篇均被引频次5.39次，排名ESI全球341位（Top 1%共401个单位），Top论文 28篇，位列全球46位。计算机科学与技术学科成为继工程学、临床医学、材料科学、生物学与生物化学之后，第5个进入ESI全球前1%行列的学科领域，这标志着计算机学科正式迈入国际高水平学科行列。 自启动高水平大学建设以来，计算机与软件学院高度重视计算机学科建设，制定了两年内进入ESI全球1%的战略目标。通过多种形式扩大学术交流与国际合作的深度和广度，大量吸引一流人才和高素质青年骨干加入，更加重视“内涵式发展”对人才培养质量的关注，战略与战术并举等多元化措施，极大的提升了学院科研水平，尤其是高水平论文的数量和质量上得到了大幅度提升，取得了一系列令人瞩目的成就。一、学科排名节节攀升6月13日，艾瑞深中国校友会网《2017中国大学评价研究报告》最新发布中国大学本科专业排行榜，深圳大学计算机科学与技术学科被评为世界高水平、中国顶尖专业，排名国内并列第六，广东省第一。 6月28日，软科世界2017一流学科排名正式发布，（ShanghaiRanking&apos;s Global Ranking of Academic Subjects）排名覆盖52个学科，涉及理学、工学、生命科学、医学和社会科学五大领域。深圳大学计算机科学与工程世界排名101-150，国内并列18位。 10月24日，USNews发布2018世界大学排行榜，深大计算机科学进入世界前200，国内32位，世界185位。二、教学成果不断涌现9月17日，第11次CCF CSP（计算机职业资格认证）在全国66所院校举办，这是2017年度CCF举办的第二次认证，来自全国200多个单位的6591人参加了本次认证。在CSP平均分排名中，我校以116人参加认证，平均分185分，300分以上15人，获得平均分全国第五名，300分以上人数全国第二名的好成绩。 10月30日起，国际工程教育专业认证专家组对计算机科学与技术专业进行了为期2天的现场考查，在经过专业问答、资料查阅、学生和用人单位访谈后，专家组给出了考查通过的结论，这标志着我们在本科生人才培养质量工作建设上正式看齐国际标准。 三、科研实力持续增强2017年1月，大数据系统计算技术国家工程实验室正式获批，这是广东省内大数据领域唯一获批的国家工程实验室；2017年6月，国家工程实验室正式挂牌运营。至此，深圳大学计算机学科形成了以3个国家级科研教学平台牵头(国家工程实验室、国家级实验教学示范中心、国家级虚拟仿真实验教学示范中心)， 9个省级平台、5个市级实验室、8个科研教学团队在内的教学科研体系。 目前，学科队伍包括中科院院士1名，国家千人1名，IEEE Fellow 2 名，杰青、优青、青千各1名；高级职称43名，海外经历教授57名，外籍教师4名；教育部教指委员1名、教育部新世纪优秀人才3名、广东省领军人才2名、广东省杰出青年基金获得者1名、广东省特支计划科技创新领军人才1名、省级“千百十”人才3名、鹏城学者1名，深圳市海外高层次人才近30余名、博士生导师11名。 近五年来，学科共获得81项国家自然科学基金，其中重点项目6项；共发表45篇CCF A类论文，ESI Top论文28篇，获得5项省部级以上科技奖，拥有3个省 部级教学科研团队；已授权或转化发明专利29项，出版专著7部。泰晤士报世界大学学科排名：深大计算机国内并列13位世界四大权威排名之一的泰晤士报世界大学2019排名发布，学科排名情况显示深圳大学计算机学科国内并列13位。不久前另外两个权威排名ARWU软科中国最好学科排名显示深大计算机学科位列前10%，排名21位；USNews 2019世界大学排行榜深大计算机学科国内排名23位，世界100强。 校友会2018中国大学计算机类专业排名出炉！深圳大学计算机科学与技术专业全国排名第五位，位居广东省第一位！为了给2018年全国高考考生和外国来华留学生选择报考中国大学计算机类本科专业提供权威参考指南，艾瑞深中国校友会网(Cuaa.Net)编写完成、科学出版社出版发行的《2018中国大学评价研究报告—中国高考志愿填报指南（校友会版）》最新发布2018中国大学一流专业排行榜、2018中国大学各学科一流专业排行榜和2018中国大学计算机类本科专业排行榜等榜单。 报告显示，全国206个专业荣膺2018中国八星级专业（8★），跻身世界一流专业、中国最顶尖专业行列；其中，深圳大学计算机科学与技术专业全国排名第5位，位居广东省第一位！软件工程专业全国排名第21位，位居广东第二位！最引人关注的是，工商管理、经济学和计算机专业最盛产全球亿万富豪，168位福布斯全球富豪榜上榜富豪财富总额高达4.32万亿, 堪称“中国全球亿万富豪摇篮”。深圳大学计算机专业造富能力最强，培养了马化腾、张志东和周群飞等4名全球顶级亿万富豪，财富总额近4500亿，雄居2018中国最具财富创造力专业排行榜榜首。 一流本科教育是建设世界一流大学的重要基础，本科专业建设是中国高校本科教育教学建设中重要工作。自2015年起，艾瑞深中国校友会网(Cuaa.Net)已连续4年发布中国大学本科专业排行榜，旨在为全国高考考生、外国来华留学生高考填报志愿挑选大学与专业提供权威参考指南。校友会 2018中国大学本科专业评价指标由学科水平、毕业生质量、师资水平、专业水平和专业影响等五大指标构成，涵盖包括了国家“双一流建设学科、教育部第四轮学科评估结果、国家级特色专业、省级特色重点专业、杰出校友和杰出师资等100多项指标，详情请参阅由艾瑞深研究院赵德国、蔡言厚、党亚茹、王凌峰、刘明和蔡莉编写完成、科学出版社面向全国出版发行的《2018中国大学评价研究报告—中国高考志愿填报指南（校友会版）》。 喜讯：明仲教授获中国电子学会科学技术奖一等奖2019年4月20日，在安徽省合肥市举办了第十四届中国电子信息技术年会，同期举行了2018年中国电子学会科学技术奖颁奖仪式，明仲教授牵头的项目获中国电子学会科学技术奖一等奖（全国21项），并代表团队上台领奖。 明仲教授牵头的项目《云数据交换与服务装备关键技术及产业化》以深圳大学为第一单位，联合华为、太极云软，从云计算的资源管理、数据交换、安全保障、硬件支撑四个方面展开研究。在理论方法、技术和装备三个层次上取得了重要突破。项目技术难度大，研究成果具有重大创新。成果广泛应用于电子政务、教育、医疗等政府职能和重大民生领域，服务于全球40个国家超过800家国内外企事业单位。取得了重大应用成果；推动了多个产业链的升级发展，社会经济效益巨大。 亚洲第三！深圳大学计算机图形学CSRankings最新排名CSRankings排行榜2016-2019区间中深圳大学计算机图形学名列亚洲第3，进入世界一流水平；计算机科学整体排名近3年位于亚洲第33位，近两年为32位，近一年排名29位，排名稳步提升！ For more infomation, visit Afficial Webpage of College of Computer Science &amp; Software Engineering, Shenzhen University 中国 广东省 深圳市 南山区 深圳大学 南校区 计算机楼（基础实验一期）","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2019-08-11T00:51:50.291Z","updated":"2019-08-11T00:51:50.291Z","comments":true,"path":"2019/08/11/hello-world/","link":"","permalink":"http://yoursite.com/2019/08/11/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}